#### Lecture 1. pandas

pandas
- 구조화된 데이터의 처리를 지원하는 python library(PANel DAta)
- 데이터 처리 및 통계 분석, numpy와 통합
- spread sheet data(행 : instance=tuple=row / 열 : attribute=feature=field=column)

In [8]:
import pandas as pd
import numpy as np

In [5]:
#data_url = 'https://archive.ics.ucl.edu/ml/machine-learning-databases/housing/housing.data'
data_url = './housing.data'
df_data = pd.read_csv(data_url, sep='\s+', header=None)
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

- head(int n:default 5) : 가장 위에 n행을 불러옴
- DataFrame : Data Table 전체를 포함하는 Object
- Series : 하나의 Column에 해당하는 데이터 모음 Object, index가 있는 numpy

In [7]:
list_data = [1,2,3,4,5]
ex_obj = pd.Series(data=list_data)
ex_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
ex_obj = pd.Series(data=dict_data, dtype=np.float32, name="example_data")
ex_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [11]:
ex_obj = ex_obj.astype(int)
ex_obj

a    1
b    2
c    3
d    4
e    5
Name: example_data, dtype: int32

In [12]:
print(ex_obj.values)
print(ex_obj.index)
ex_obj.name = "number"
ex_obj.index.name = "alphabet"
ex_obj

[1 2 3 4 5]
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

alphabet
a    1
b    2
c    3
d    4
e    5
Name: number, dtype: int32

In [26]:
raw_data = {
    "first_name": ["Jason", "Molly", "Tina", "Jake", "Amy"],
    "last_name": ["Miller", "Jacobson", "Ali", "Milner", "Cooze"],
    "age": [42, 52, 36, 24, 73],
    "city": ["San Francisco", "Baltimore", "Miami", "Douglas", "Boston"],
}
df = pd.DataFrame(raw_data, columns=["first_name", "last_name", "age", "city", "debt"])
pd.DataFrame(raw_data, columns = ["age", "city"])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [17]:
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [18]:
type(df.city)

pandas.core.series.Series

In [20]:
s = pd.Series(np.nan, index=[7,6,4,3,2,1])
print(s.loc[:2]) # loc : index 이름으로 검색
print(s.iloc[:2]) # loc : index number로 검색

7   NaN
6   NaN
4   NaN
3   NaN
2   NaN
dtype: float64
7   NaN
6   NaN
dtype: float64

In [21]:
df.loc[:, ["first_name", "last_name"]]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       Tina       Ali
3       Jake    Milner
4        Amy     Cooze

In [27]:
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [28]:
df.debt = df.age > 40 # boolean 할당
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [29]:
# Jason to pandas
pop = {"Nevada": {2001: 2.5, 2002: 2.7}, "ohio": {2001: 3.2, 2002:-0.8, 2004:3.7}}
pd.DataFrame(pop)

      Nevada  ohio
2001     2.5   3.2
2002     2.7  -0.8
2004     NaN   3.7

indexing
- df\[\["name","street"]][:2]   # column + index number
- df.loc\[\[211829, 320563]]["name","street"]   # column + index name
- df.iloc[:2, :2]   # column number + index number

inplace=True : df 자체에 변화가 일어나도록 함

Dataframe operation
- df는 column과 index 모두 고려
- add 시 NaN 값 0으로 변환
- series + dataframe : axis를 기준으로 row broadcasting 실행

map, lambda, replace
- pandas의 series type data도 map 함수 사용가능
- replace func : map 중 데이터 변환 기능만 담당

In [30]:
df = pd.read_csv("./wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [31]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [32]:
def change_sex(x):
    return 0 if x == "male" else 1
df.sex.map(change_sex).head(10)

0    0
1    1
2    1
3    1
4    1
5    1
6    1
7    0
8    0
9    0
Name: sex, dtype: int64

applymap : series가 아닌 element 단위로 함수 적용 시

Pandas 내장함수
- describe : numeric type data 의 요약 정보
- unique : series data의 유일한 값
- sub, mean, min, max, count, median, var 등 기본적인 연산 함수 지원
- isnull : NaN(null)값의 인덱스 반환
- sort_values : column 값을 기준으로 정렬(ascending=True : 오름차순)
- corr, cov, corrwith : 상관계수 및 공분산 구하기
- value_counts : 개수 세기
- pd.options.display.max_rows = num (num 줄만큼 화면에 출력)

#### Lecture 2. 딥러닝 학습 방법

신경망(neural network) - 비선형모델(선형모델 + 비선형함수)
O(n x p) = X(n x d) W(d x p) + b(n x p) (ouput = data x weight + bias)
softmax function
- 모델의 출력을 확률로 해석할 수 있게 변환, 분류 문제
- 추론을 할 때는 one-hot 벡터로 최대값을 가진 주소만 1로 출력(softmax X)
- 활성함수는 잠재벡터의 각 노드에 개별적으로 적용하여 새로운 잠재벡터를 만듬(neuron, perceptron)

In [34]:
def softmax(vec):
    denumerator = np.exp(vec - np.max(vec, axis=-1, keepdims=True))
    numerator = np.sum(denumerator, axis=-1, keepdims=True)
    val = denumerator / numerator
    return val
vec = np.array(([1,2,4], [-1, 0, 1], [-4, 3, 0]))
softmax(vec)

array([[4.20100661e-02, 1.14195199e-01, 8.43794734e-01],
       [9.00305732e-02, 2.44728471e-01, 6.65240956e-01],
       [8.67881295e-04, 9.51747406e-01, 4.73847131e-02]])

활성함수(activation function)
- 활성함수를 쓰지않으면 딥러닝은 선형모형과 아무 차이가 없음
- sigmoid $\sigma(x)=\frac{1}{1+e^{-x}} $
- tanh $tanh(x)=\frac{e^x-e^{-x}}{e^x+e^{-x}} $
- ReLU $ReLU(x)=max[0,x]$   << 가장 많이 쓰이는 함수

다층(multi-layer) 퍼셉트론(MLP) : 신경망이 여러층 합성된 함수
- 순전파(forward propagation) : 순차적인 신경망 계산
- 층이 깊을 수록 목적함수를 근사하는데 필요한 뉴런(노드)의 숫자가 훨씬 빨리 감소
- 복잡화된 함수를 얻을 수 있으나 최적화와는 관계가 없음

딥러닝 학습원리 : 역전파(back propagation)
- 각 층 parameter의 gradient vector는 역순으로 계산됨
- 합성 함수 미분법인 - chain-rule 기반 자동미분 사용 $ \frac{\partial z}{\partial x} = \frac{\partial z}{\partial w} \frac{\partial w}{\partial x} $
- 역전파 적용 예제 수식은 공부할 것